/*
Created by Issashu Greybeard on 22.06.22.

 В архива имате започната, НО недовършена програма за управление на ресторант. В различните модули има код управляващ
 кухнята, код за "готварската книга"

 Добавете функции, променливи, масиви и каквото друго ще потрябва, за да можете да:

 1. Знаете колко маси има ресторанта ви.
 2. Знаете, коя маса е свободна и коя - не.
 3. Знаете, коя маса, каква поръчка има.

 В момента, в който някоя маса се освободи, приемаме, че идва нов клиент, който ще поръча. В момента, в който си получи
 поръчката приемаме, че масата се освобождава (по избор може да се сложи таймер, в който клиента хапва :) ).

 Програмата продължава докато всяка маса приеме общо 5 клиента.

 Имате пълна свобода как ще напишете тази част. Важно е всеки от екипа да знае, какво се случва и най-вече ЗАШО
 е направено по дадения начин.

*/
#include "defines.h"
#include "restaurant.h"

int main() {
    short business = TRUE;

    while (business){
        business = openForBusiness();
    }

    return EXIT_OK;
}
